//#include<stdio.h>
//
//
//int main(void)
//{
//	//problem_1	
//	//printf("10진수 8부터 20까지 20진수와 16 진수로 표현해보자\n");
//	
//	//2진수						16진수
//	//8		1000(2)				8
//	//9		1001(2)				9
//	//10	1010(2)				A
//	//11	1011(2)				B
//	//12	1100(2)				C
//	//13	1101(2)				D
//	//14	1110(2)				E	
//	//15	1111(2)				F
//	//16	0001 0000(2)		10
//	//17	0001 0001(2)		11
//	//18	0001 0010(2)		12
//	//19	0001 0011(2)		13
//	//20	0001 0100(2)		14
//
//	//problem_4_4_1
//	/*int num = 0;
//	printf("정수 입력 : ");
//	scanf_s("%d", &num);
//	int reverse = ~num + 1;
//	printf("부호반대 %d", reverse);*/
//	return 0;
//}